
# 作业三：多级菜单
# 三级菜单
# 可依次选择进入各子菜单
# 所需新知识点：列表、字典

menu = {
    '北京': {
        '朝阳': {
            '国贸': {
                'CICC': {},
                'HP': {},
                '渣打银行': {},
                'CCTV': {},
            },
            '望京': {
                '陌陌': {},
                '奔驰': {},
                '360': {},
            },
            '三里屯': {
                '优衣库': {},
                'apple': {},
            },
        },
        '昌平': {
            '沙河': {
                '老男孩': {},
                '老男人': {},
            },
            '天通苑': {
                '链家': {},
                '5i5j': {},
            },
            '回龙观': {},
        },
        '海淀': {
            '五道口': {
                '谷歌': {},
                '网易': {},
                '搜狐': {},
                '搜狗': {},
                '快手': {},
            },
            '中关村': {
                '优酷': {},
                '爱奇艺': {},
                '汽车之家': {},
                '新东方': {},
                '腾讯': {},
            }
        }
    },
    '上海': {
        '浦东': {
            '51job': {},
            '蚂蚁金服': {},
            '天翼视讯': {},
            '外滩': {},
        },
        '徐汇': {
            '爱奇艺': {},
            '网宿': {},
            '腾讯': {},
        },
    },
    '河南': {
        '郑州市': {
            '二七区': {},
            '金水区': {},
            '郑东新区': {},
        },
        '信阳市': {
            '平桥区': {},
            '浉河区': {},
        },
    }
}

choice_flag = True
while choice_flag:
    choice = input("input>>:")
    if choice == "q":
        choice_flag = False
    else:
        print(list(menu[choice].keys()))










